app/Helpers/log_helper.php

INSERT INTO `tb_log_activities` (`user_id`, `activity`, `url`, `method`, `user_agent`, `ip_address`, `created_at`, `updated_at`) VALUES ('1', 'Mengakses halaman Dashboard', 'http://localhost/webgis-serang/public/index.php/', 'GET', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/138.0.0.0 Safari/537.36 Edg/138.0.0.0', '::1', '2025-08-03 21:57:54', '2025-08-03 21:57:54')
---
    function log_activity(string $activity)
    {
        $model = new LogActivity();

        $session = session();
        $user_id = $session->get('id') ?? null;

        $model->insert([
            'user_id'     => $user_id,
            'activity'    => $activity,
            'url'         => current_url(),
            'method'      => service('request')->getMethod(),
            'user_agent'  => service('request')->getUserAgent(),
            'ip_address'  => service('request')->getIPAddress(),
        ]);